In [1]:
print("Yashinta Eka Widyasari-200601110062-PPK(F)")

Yashinta Eka Widyasari-200601110062-PPK(F)

Pandas

Pandas adalah sebuah librari berlisensi BSD yang memiliki struktur data yang diperlukan untuk mengkonversi data ke dalam format tabel untuk memudahkan analisis

DataFrame

DataFrame merupakan struktur dasar dari pandas dengan koleksi kolom yang berurutan denang bentuk sebuah tabel yang tampak seperti database.
Dengan adatanya fitur ini dapat memudahkan untuk membaca sebuah file dan menjadikannya tabel.

Kegunaan Pandas

- Dapat membaca dan menulis file ke bentuk CSV dan file lainnya dalam database
- Dapat digunakan untk menghitung jumlah statistik dalam data seperti menghitung rata-rata, media, maximum atau minimum
- Membersihkan data dengan menghapus nilai yang hilang (missing values) dan menyortir kolom dan baris, dapat memvisualisasikan data dengan bantuan Matplotlib
- Dapat digunakan untuk mengolah data dengan menggunakan operasi seperti join, distinct, group by, agregasi dan teknik lainnya

Cara Install Pandas

Cara yang dilakukan untuk menginstall pandas adalah dengan mengetik kode berikut pada command prompt
- conda install pandas, atau
- pip install pandas

Cara Import Pandas

Untuk menginstall pandas dapat dilakukan dengan mengetik kode berikut pada aplikasi
- import panda as pd

Komponen Utama pada Pandas

- Series adalah suatu kolom 
- DataFrame adalah kumpulan dari series, dapat berupa tabel atau multidimensi

Pembuatan DataFrame

Dataframe dapat terbentuk dari hasil read data atau dapat dibuat sendiri(created from scratch), dengan cara paling sederhana adalah dengan menggunakan struktur data dict dalam python.

Contoh Pembuatan DataFrame

In [7]:
import pandas as pd

data={'apples':[5,6,2,3], 'oranges':[1,3,4,0]}
purchases=pd.DataFrame(data)
print(purchases)

   apples  oranges
0       5        1
1       6        3
2       2        4
3       3        0

Penambahan Index Dalam sebuah DataFrame

In [6]:
purchases=pd.DataFrame(data,index=['Maddy','Rue','Alex','Dean'])
print(purchases)

       apples  oranges
Maddy       5        1
Rue         6        3
Alex        2        4
Dean        3        0

Untuk Mengakses setiap index yang ada kita dapat melakukannya seperti dibawah ini

In [7]:
print(purchases.loc['Rue'])

apples     6
oranges    3
Name: Rue, dtype: int64

Cara membaca data 

- df=pd.read_csv('purchases.csv') > purchases.csv adalah nama file

Tanpa Index otomatis
- df=pd.read_csv('purchases.csv', index_col=0)

Baca JSON
- df=pd.read_json('purchases.json')

Baca Excel
- df1=pd.read_excel("mhs.xlsx", sheet_name='mahasiswa') > dimana mhs.xlsx adalah nama file excel

Fungsi lainnya

- df.head() → pengambilan 5 data pertama
- df.head(10)→ pengambilan 10 data pertama df.tail(8)→ pengambilan 8 data terakhir
- df.columns menampilkan nama kolom
- df[['nama', 'alamat']] > pilih kolom tertentu 

• Mengacu ke data sebelumnya :

purchases["oranges"].min()→ data terkecil
purchases["oranges"].max)→ data terbesar purchases["oranges"].mean()→ rata-rata
purchases["oranges").sum()→ jumlah
purchases["oranges"].count() cacah purchases[purchases['oranges'] == 3] → filter data

Operator Logical

logical operators | untuk "or" dan & untuk "and". 
- df [ (df ['jur'] 'SI') (df['jur'] == 'TI')].head ()

Penggunaan

isin

df (df ['jur'].isin (['SI', 'TI'])].head()

Cara menambahkan kolom Baru

In [6]:
import pandas as pd

data1=pd.DataFrame({'celcius': [17.0, 25.0]}, index=['Bantul','Sleman'])
print(data1)

        celcius
Bantul     17.0
Sleman     25.0

Apabila Akan ditambahkan kolom Fahrenheit

In [11]:
data1=data1.assign(fah=data1['celcius']*9/5+32)
print(data1)

        celcius   fah
Bantul     17.0  62.6
Sleman     25.0  77.0

Apabila Akan ditambahkan kolom lambda function

In [12]:
data1=data1.assign(rea=lambda x: x.celcius*4/5)
print(data1)

        celcius   fah   rea
Bantul     17.0  62.6  13.6
Sleman     25.0  77.0  20.0

In [5]:
import pandas as pd

print("Apply Function")

data2=pd.DataFrame({'Nama':['Andi', 'Rudi', 'Siti', 'Ani'], 'IPK':[2.3, 3.1, 1.8, 2.9]})
print(data2)

Apply Function
   Nama  IPK
0  Andi  2.3
1  Rudi  3.1
2  Siti  1.8
3   Ani  2.9

Apabila ingin ditambah  fungsi

In [18]:
def group_nilai(a):
    if a>2.75:
        hasil="Sangat Bagus"
    elif a==2.75:
        hasil="Bagus"
    else:
        hasil="Cukup"
    return hasil
    
data2=data2.assign(status=data2['IPK'].apply(group_nilai))
print(data2)

   Nama  IPK        status    Keterangan
0  Andi  2.3         Cukup         Cukup
1  Rudi  3.1  Sangat Bagus  Sangat Bagus
2  Siti  1.8         Cukup         Cukup
3   Ani  2.9  Sangat Bagus  Sangat Bagus

Memanggil data tertentu pada DataFrame

Contoh didapat DataFrame seperti dibawah ini

In [30]:
import pandas as pd
import numpy as np

df=[['Clarisa',26],['Gavin',24],['Lia',16],['Ale',22]]
data3=pd.DataFrame(df,columns=['Nama','Usia'])
print(data3)

      Nama  Usia
0  Clarisa    26
1    Gavin    24
2      Lia    16
3      Ale    22

Apabila ingin memanggil kolom tertentu

In [3]:
data3["Usia"]

0    26
1    24
2    16
3    22
Name: Usia, dtype: int64

In [15]:
data3["Nama"]

0    Clarisa
1      Gavin
2        Lia
3        Ale
Name: Nama, dtype: object

In [17]:
data3.iloc[0][0]

'Clarisa'

In [18]:
data3.iloc[0]['Nama']

'Clarisa'

In [20]:
data3.at[0,'Nama']

'Clarisa'

In [21]:
data3.iat[0,0]

'Clarisa'

In [22]:
data3.iloc[0]

Nama    Clarisa
Usia         26
Name: 0, dtype: object

In [23]:
data3.loc[:,'Nama']

0    Clarisa
1      Gavin
2        Lia
3        Ale
Name: Nama, dtype: object

Set Index

In [28]:
df1=pd.DataFrame([['Clarisa',26],['Gavin',24],['Lia',16],['Ale',22]],columns=['Nama','Usia'])
df1

      Nama  Usia
0  Clarisa    26
1    Gavin    24
2      Lia    16
3      Ale    22

In [29]:
df1.set_index('Nama')

         Usia
Nama
Clarisa    26
Gavin      24
Lia        16
Ale        22

In [46]:
df2=pd.DataFrame(data=np.array([[1,2,3],[4,5,6],[7,8,9]]), index=['A','B','C'], columns=[48,49,50])
df2

   48  49  50
A   1   2   3
B   4   5   6
C   7   8   9

In [47]:
df2.loc['A']

48    1
49    2
50    3
Name: A, dtype: int32

In [48]:
df2.iloc[2]

48    7
49    8
50    9
Name: C, dtype: int32

Menambah Kolom

In [49]:
df3=pd.DataFrame([['Clarisa',26],['Gavin',24],['Lia',16],['Ale',22]], columns=['Nama','Usia'])
df3['index']=df3.index
df3

      Nama  Usia  index
0  Clarisa    26      0
1    Gavin    24      1
2      Lia    16      2
3      Ale    22      3

In [50]:
#Menambahkan kolom baru
df3.loc[:,'Gender']=pd.Series(['P','L','P','L'])
df3

      Nama  Usia  index Gender
0  Clarisa    26      0      P
1    Gavin    24      1      L
2      Lia    16      2      P
3      Ale    22      3      L

Melihat Ukuran DataFrame

In [51]:
#ukuran baris paling panjang 
len(data3)

4

In [52]:
#ukuran baris pada kolom tertentu
print(data3.shape)

(4, 2)

Menghapus

In [65]:
#menghapus kolom
del df3['Gender']
df3

      Nama  Usia  index
0  Clarisa    26      0
1    Gavin    24      1
2      Lia    16      2
3      Ale    22      3

In [82]:
df4=pd.DataFrame([['Clarisa',26],['Gavin',24],['Lia',16],['Ale',22]], columns=['Nama','Usia'])
df4

      Nama  Usia
0  Clarisa    26
1    Gavin    24
2      Lia    16
3      Ale    22

In [84]:
#menghapus n baris di awal
df4=df4[1:]
df4

    Nama  Usia
1  Gavin    24
2    Lia    16
3    Ale    22

In [85]:
#menghapus baris tertentu
df4=df4.drop(df4.index[[0,2]])
df4

  Nama  Usia
2  Lia    16

IMPOR PANDAS

In [9]:
import pandas as pd
import numpy as np

Import .txt

untuk import file.txt maka siapkan file .txt nya terlebih dahulu pada folder yang sama dengan program

In [10]:
data4=pd.read_csv("data.txt")
print(data4)

   A\tB
0  1\t2
1  4\t3
2  4\t2

untuk mengeliminasi sebuah elemen pada output tersebut maka seperti dibawah ini

In [11]:
data5=pd.read_csv("data.txt", delimiter="\t")
print(data5)

   A  B
0  1  2
1  4  3
2  4  2

Import .csv

untuk import file .csv maka siapkan file .csv nya terlebih dahulu pada folder yang sama dengan program

In [12]:
data6=pd.read_csv("data.csv")
print(data6)

   A  B
0  1  2
1  4  3
2  4  2

Import .xlsx

untuk import file .xlsx maka siapkan file .xlsx nya terlebih dahulu pada folder yang sama dengan program

In [87]:
#import pandas dan numpy
import pandas as pd
import numpy as np
#misal punya suatu dataframe
data = [[1,32],[2,43],[4,55]]
df = pd.DataFrame(data, columns=['nama','usia'])
#convert ke numpy array
databaru= df.to_numpy()
print(databaru)
#convert ke txt
df.to_csv('dataexport.csv')

[[ 1 32]
 [ 2 43]
 [ 4 55]]